ServiceDesk/src/Documents/ЕжедневныйОтчет/ЕжедневныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕжедневныйОтчет</name>
  <registerRecords>AccumulationRegister.РабочееВремяПользователей</registerRecords>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеВремени</name>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаПользователя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ServiceDesk/src/Documents/ЕжедневныйОтчет/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РабочееВремяПользователей	= ЭтотОбъект.Движения.РабочееВремяПользователей;
	
	Для Каждого СтрокаТЧ Из ИспользованиеВремени Цикл
		
		Запись	= РабочееВремяПользователей.Добавить();
		
		Запись.Период				= ОтчетнаяДата;
		Запись.Исполнитель			= Исполнитель;		
		Запись.Заявка				= СтрокаТЧ.Заявка;		
		Запись.ДлительностьЧисло	= СтрокаТЧ.ДлительностьЧисло;
		
	КонецЦикла; 		
	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Для Каждого СтрокаТЧ Из ИспользованиеВремени Цикл		
		СтрокаТЧ.ДлительностьЧисло	= (СтрокаТЧ.Длительность - НачалоДня(СтрокаТЧ.Длительность)) / 3600;
	КонецЦикла; 		
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ИспользованиеВремени.Очистить();
КонецПроцедуры
